Ludovic-Lesur/stm32l0xx-registers/inc/gpio_registers.h
/*
 * gpio_registers.h
 *
 *  Created on: 26 apr. 2018
 *      Author: Ludo
 */

#ifndef __GPIO_REGISTERS_H__
#define __GPIO_REGISTERS_H__

#ifndef STM32L0XX_REGISTERS_DISABLE_FLAGS_FILE
#include "stm32l0xx_registers_flags.h"
#endif
#include "types.h"

/*** GPS REGISTERS macros ***/

// Peripherals base address.
#define GPIOA   ((GPIO_registers_t*) ((uint32_t) 0x50000000))
#define GPIOB   ((GPIO_registers_t*) ((uint32_t) 0x50000400))
#define GPIOC   ((GPIO_registers_t*) ((uint32_t) 0x50000800))
#if (STM32L0XX_REGISTERS_MCU_CATEGORY == 3) || (STM32L0XX_REGISTERS_MCU_CATEGORY == 5)
#define GPIOD   ((GPIO_registers_t*) ((uint32_t) 0x50000C00))
#endif
#if (STM32L0XX_REGISTERS_MCU_CATEGORY == 5)
#define GPIOE   ((GPIO_registers_t*) ((uint32_t) 0x50001000))
#endif
#if (STM32L0XX_REGISTERS_MCU_CATEGORY == 2) || (STM32L0XX_REGISTERS_MCU_CATEGORY == 3) || (STM32L0XX_REGISTERS_MCU_CATEGORY == 5)
#define GPIOH   ((GPIO_registers_t*) ((uint32_t) 0x50001C00))
#endif

/*** GPIO REGISTERS structures ***/

/*!******************************************************************
 * \struct GPIO_registers_t
 * \brief GPIO registers map.
 *******************************************************************/
typedef struct {
    volatile uint32_t MODER;
    volatile uint32_t OTYPER;
    volatile uint32_t OSPEEDR;
    volatile uint32_t PUPDR;
    volatile uint32_t IDR;
    volatile uint32_t ODR;
    volatile uint32_t BSRR;
    volatile uint32_t LCKR;
    volatile uint32_t AFRL;
    volatile uint32_t AFRH;
    volatile uint32_t BRR;
} GPIO_registers_t;

#endif /* __GPIO_REGISTERS_H__ */
